cask_args appdir: '/Applications'

#------------------------------------------
# tap
#------------------------------------------
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/dupes'
tap 'homebrew/apache'
tap 'homebrew/science'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'sanemat/font'


#------------------------------------------
# brew
#------------------------------------------
brew 'coreutils'
brew 'mas'

brew 'git'
brew 'tig'

brew 'fish'
brew 'hub'
brew 'ghq'
brew 'peco'
brew 'bat'

brew 'zsh'
brew 'zsh-completions'
brew 'emojify'
brew 'jq'

brew 'vim', args: ['with-lua']
brew 'neovim'
brew 'ctags'
brew 'global', args: ['with-pygments']
brew 'ricty', args: ['with-powerline']

brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'tmux-xpanes'

brew 'gnuplot', args: ['with-x11']

brew 'python'
brew 'python@2'
brew 'pyenv'
brew 'ruby-build'
brew 'rbenv'
brew 'kotlin'
brew 'go'
brew 'lua'
brew 'awk'

brew 'heroku'
brew 'unicorn'
brew 'nginx'
brew 'redis'
brew 'sqlite'
brew 'postgresql'

brew 'yarn'
brew 'node'
brew 'llvm'
brew 'cmake'
brew 'imagemagick@6'
brew 'nodenv'

brew 'highlight'
brew 'httpd'
brew 'pandoc'
brew 'cowsay'
brew 'nmap'
brew 'easy-tag'


#------------------------------------------
# cask
#------------------------------------------
cask 'google-chrome'
cask 'iterm2'
cask 'mactex'
cask 'docker'
cask 'docker-toolbox'

cask 'dash'
cask 'alfred'
cask 'cheatsheet'
cask 'appcleaner'
cask 'bettertouchtool'
cask 'skim'

cask 'sublime-text'
cask 'atom'
cask 'visual-studio-code'
cask 'breckets'
cask 'android-studio'
cask 'intellij-idea-ce'
cask 'pycharm-ce'

cask 'java'

cask 'androidtool'
cask 'android-platform-tools'

cask '0xed'
cask 'fiddler'
cask 'mono-mdk'
cask 'mendeley'
cask 'wireshark'
cask 'netspot'

cask 'skype'
cask 'zoomus'
cask 'notion'
cask 'kindle'
cask '4k-video-downloader'
cask 'xld'


#------------------------------------------
# mas
#------------------------------------------
mas 'Xcode', id: 497799835
mas 'Fotor Photo Editor', id: 503039729
mas 'GarageBand', id: 682658836
mas 'iMovie', id: 408981434
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'QaLL', id: 480452005
mas 'Slack', id: 803453959
mas 'PicGIF Lite', id: 844918735
mas 'To MP3 Converter Free', id: 983472324
