cask_args appdir: '/Applications'

#------------------------------------------
# tap
#------------------------------------------
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/dupes'
tap 'homebrew/apache'
tap 'homebrew/science'
tap 'homebrew/core'


#------------------------------------------
# brew
#------------------------------------------
brew 'coreutils'
brew 'mas'
brew 'git'
brew 'zsh'
brew 'zsh-completions'
brew 'vim', args: ['with-lua']
brew 'neovim'
brew 'tmux'

brew 'ctags'
brew 'global', args: ['with-pygments']
brew 'reattach-to-user-namespace'
brew 'dash'
brew 'gnuplot', args: ['with-x11']

brew 'hub'
brew 'ghq'
brew 'peco'

brew 'python'
brew 'pyenv'
brew 'rbenv'
brew 'ruby-build'
brew 'go'
brew 'lua'

brew 'opencv'
brew 'opencv@2'

brew 'heroku'
brew 'unicorn'
brew 'nginx'
brew 'redis'
brew 'sqlite'
brew 'postgresql'

brew 'highlight'
brew 'httpd'
brew 'pandoc'
brew 'cowsay'
brew 'nmap'

#------------------------------------------
# cask
#------------------------------------------
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'firefox'

cask 'iterm2'
cask 'mactex'
cask 'docker'
cask 'docker-toolbox'

cask 'alfred'
cask 'appcleaner'
cask 'android-file-transfer'
cask 'bettertouchtool'
cask 'skim'

cask 'java'

cask 'android-studio'
cask 'androidtool'
cask 'android-platform-tools'
cask 'pycharm'
cask 'atom'
cask 'sublime-text'

cask '0xed'
cask 'fiddler'
cask 'mendeley'
cask 'wireshark'

cask 'mono-mdk'
cask 'skype'
cask '4k-video-downloader'


#------------------------------------------
# mas
#------------------------------------------
mas 'Fotor Photo Editor', id: 503039729
mas 'GarageBand', id: 682658836
mas 'iMovie', id: 408981434
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'QaLL', id: 480452005
mas 'Slack', id: 803453959
