cask_args appdir: '/Applications'

#------------------------------------------
# tap
#------------------------------------------
tap 'homebrew/core'
tap 'homebrew/services'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'sanemat/font'
tap 'kyoshidajp/ghkw'

#------------------------------------------
# brew
#------------------------------------------
brew 'coreutils'
brew 'mas'

brew 'zsh'
brew 'zsh-completions'
brew 'zplug'
brew 'ghkw'
brew 'fzf'
brew 'emojify'
brew 'jq'
brew 'fpp'
brew 'fish'
brew 'xonsh'

brew 'git'
brew 'tig'
brew 'hub'
brew 'ghq'
brew 'peco'
brew 'bat'
brew 'tree'

brew 'vim', args: ['with-lua']
brew 'neovim'
brew 'ctags'
brew 'global', args: ['with-exuberant-ctags', 'with-pygments']
brew 'tmux'
brew 'reattach-to-user-namespace'

cask 'xquartz' # dependency
brew 'gnuplot', args: ['with-x11']

brew 'ruby-build'
brew 'rbenv'
brew 'kotlin'
brew 'go'
brew 'lua'
brew 'awk'
brew 'gradle'
brew 'gradle-completion'

brew 'heroku'
brew 'unicorn'
brew 'nginx'
brew 'redis'
brew 'sqlite'
brew 'postgresql'

brew 'yarn'
brew 'node'
brew 'llvm'
brew 'cmake'
brew 'imagemagick@6'
brew 'graphviz'
brew 'readline'
brew 'openssl'

brew 'highlight'
brew 'httpd'
brew 'pandoc'
brew 'cowsay'
brew 'nmap'
brew 'easy-tag'
brew 'wget'

#------------------------------------------
# cask
#------------------------------------------
cask 'station'
cask 'google-chrome'
cask 'firefox'
cask 'mactex'
cask 'docker'
cask 'docker-toolbox'

cask 'alacritty'
cask 'iterm2'
cask 'hyper'
cask 'cool-retro-term'

cask 'dash'
cask 'alfred'
cask 'cheatsheet'
cask 'appcleaner'
cask 'bettertouchtool'
cask 'skim'

cask 'sublime-text'
cask 'atom'
cask 'visual-studio-code'
cask 'brackets'
cask 'android-studio'
cask 'intellij-idea-ce'
cask 'pycharm-ce'

cask 'java'
cask 'androidtool'
cask 'android-platform-tools'

cask 'adobe-creative-cloud'
cask 'postman'
cask 'mendeley'
cask 'quail'
cask 'tunnelblick'
cask 'skype'
cask 'zoomus'
cask 'notion'
cask 'kindle'
cask '4k-video-downloader'
cask 'xld'

cask '0xed'
cask 'wireshark'
cask 'netspot'
