oh-my-fish/plugin-balias
edc/bass
oh-my-fish/theme-bobthefish
tasuten/cd-gitroot-fish
fisherman/docker-completion
b4b4r07/enhancd
fisherman/fishtape
fisherman/fzf
fisherman/getopts
decors/fish-ghq
fisherman/imgcat
fisherman/pyenv
fisherman/rbenv
fisherman/spin
fisherman/z
