oh-my-fish/plugin-balias
edc/bass
tasuten/cd-gitroot-fish
fisherman/docker-completion
fisherman/getopts
decors/fish-ghq
simnalamburt/shellder
fisherman/spin
fisherman/z
